(package! gcmh) ;; https://github.com/emacsmirror/gcmh

(package! evil-escape :disable t)

(package! aweshell
  :recipe (:host github
           :repo "manateelazycat/aweshell")) ;; https://github.com/manateelazycat/aweshel

(package! langtool :disable t)

(unpin! flymake)

;; (unpin! magit)
(unpin! magit-todos)
(unpin! pcre2el)
(package! with-editor)

(package! org-super-agenda) ;; https://github.com/alphapapa/org-super-agenda

(package! org-modern) ;; https://github.com/minad/org-modern

(package! org-modern-indent
  :recipe (:host github :repo "jdtsmith/org-modern-indent"))

(package! org-gtd) ;; https://github.com/Trevoke/org-gtd.el

(package! org-appear) ;; https://github.com/awth13/org-appear

(package! org-books) ;; https://github.com/lepisma/org-books

(package! org-noter) ;; https://github.com/org-noter/org-noter

(package! org-now
  :recipe (:host github :repo "alphapapa/org-now")) ;; https://github.com/alphapapa/org-now

(package! org-sidebar
  :recipe (:host github :repo "alphapapa/org-sidebar")) ;; https://github.com/alphapapa/org-sidebar
(package! org-ql
  :recipe (:host github :repo "alphapapa/org-ql")) ;; https://github.com/alphapapa/org-ql

(package! org-remark) ;; https://github.com/nobiot/org-remark

;; (package! image-popup
;;   :recipe (:host gitlab :repo "OlMon/image-popup")) ;; https://gitlab.com/OlMon/image-popup

(package! ob-mermaid) ;; https://github.com/arnm/ob-mermaid

(package! spacious-padding) ;; https://github.com/protesilaos/spacious-padding

(package! affe) ;; https://github.com/minad/affe

(package! blamer) ;; https://github.com/Artawower/blamer.el

(package! circadian) ;; https://github.com/guidoschmidt/circadian.el

(package! ef-themes) ;; https://github.com/protesilaos/ef-themes

(package! focus) ;; https://github.com/larstvei/Focus

(package! grugru) ;; https://github.com/ROCKTAKEY/grugru

(package! info-colors) ;; https://github.com/ubolonton/info-colors

(package! jinx) ;; https://github.com/minad/jinx

(package! jq-mode) ;; https://github.com/ljos/jq-mode

(package! languagetool) ;; https://github.com/PillFall/languagetool.el

(package! litable
  :recipe (:host github :repo "Fuco1/litable")) ;; https://github.com/Fuco1/litable

(package! logos) ;; https://github.com/protesilaos/logos

(package! mlscroll) ;; https://github.com/jdtsmith/mlscroll

(package! modus-themes) ;; https://github.com/protesilaos/modus-themes

(package! nov) ;; https://depp.brause.cc/nov.el/

(package! nushell-ts-mode
  :recipe (:host github :repo "herbertjones/nushell-ts-mode")) ;; https://github.com/herbertjones/nushell-ts-mode

(package! obvious
  :recipe (:host github :repo "alphapapa/obvious.el")) ;; https://github.com/alphapapa/obvious.el

(package! olivetti) ;; https://github.com/rnkn/olivetti

(package! paren-face) ;; https://github.com/tarsius/paren-face

(package! puni) ;; https://github.com/AmaiKinono/puni

(package! pulsar) ;; https://github.com/protesilaos/pulsar

(package! rotate) ;; https://github.com/daichirata/emacs-rotate

(package! tempel) ;; https://github.com/minad/tempel
(package! tempel-collection) ;; https://github.com/Crandel/tempel-collection

(package! verb) ;; https://github.com/federicotdn/verb

(package! zoom) ;; https://github.com/cyrus-and/zoom

(package! fontaine) ;; https://github.com/protesilaos/fontaine

(unpin! nix-mode)

(package! evil-fringe-mark) ;; https://github.com/Andrew-William-Smith/evil-fringe-mark

(package! org-wild-notifier) ;; https://github.com/akhramov/org-wild-notifier.el

(package! systemd) ;; https://github.com/holomorph/systemd-mode

(package! nano-modeline)

(package! helm :disable t)
(package! helm-org :disable t)

(package! orgtbl-aggregate)

(package! kanagawa-themes) ;; https://github.com/Fabiokleis/kanagawa-emacs
